## [applications/baz/stage](https://omicron7.app.spacelift.io/stack/applications-baz-stage/run/01HSY839PH8JS55363GWSD6FMW) plan logs

<details>
<summary>Click here to expand</summary>

```
[01HSXN7G334Z1QK0BK6FT8CK4N] Planning changes with 0 custom hooks...
ansible_host.app1: Refreshing state... [id=app1]
ansible_group.linux: Refreshing state... [id=stage]
ansible_host.app3: Refreshing state... [id=app3]
ansible_host.app2: Refreshing state... [id=app2]
data.spacelift_current_stack.this: Reading...
data.spacelift_aws_integration.aws: Reading...
data.spacelift_current_stack.this: Read complete after 0s [id=applications-baz-stage]
data.spacelift_stack.this: Reading...
data.spacelift_aws_integration.aws: Read complete after 0s [id=01HQV4XANFANXQY4NS3HDNJSCN]
data.spacelift_stack.this: Read complete after 0s [id=applications-baz-stage]
spacelift_stack.this: Refreshing state... [id=applications-testing-stage]
spacelift_environment_variable.terraform_state_key: Refreshing state... [id=stack/ansible-applications-testing-stage/TERRAFORM_STATE_KEY]
spacelift_aws_integration_attachment.aws: Refreshing state... [id=01HQV4XANFANXQY4NS3HDNJSCN/ansible-applications-testing-stage]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # ansible_group.linux will be destroyed
  # (because ansible_group.linux is not in configuration)
  - resource "ansible_group" "linux" {
      - id        = "stage" -> null
      - name      = "stage" -> null
      - variables = {
          - "ansible_user" = "root"
          - "os"           = "linux"
        } -> null
    }

  # ansible_group.stage will be created
  + resource "ansible_group" "stage" {
      + id        = (known after apply)
      + name      = "stage"
      + variables = {
          + "ansible_user" = "root"
          + "os"           = "linux"
        }
    }

  # ansible_host.app1 will be destroyed
  # (because ansible_host.app1 is not in configuration)
  - resource "ansible_host" "app1" {
      - groups    = [
          - "stage",
        ] -> null
      - id        = "app1" -> null
      - name      = "app1" -> null
      - variables = {
          - "ansible_host" = "127.0.0.1"
        } -> null
    }

  # ansible_host.app2 will be destroyed
  # (because ansible_host.app2 is not in configuration)
  - resource "ansible_host" "app2" {
      - groups    = [
          - "stage",
        ] -> null
      - id        = "app2" -> null
      - name      = "app2" -> null
      - variables = {
          - "ansible_host" = "127.0.0.1"
        } -> null
    }

  # ansible_host.app3 will be destroyed
  # (because ansible_host.app3 is not in configuration)
  - resource "ansible_host" "app3" {
      - groups    = [
          - "stage",
        ] -> null
      - id        = "app3" -> null
      - name      = "app3" -> null
      - variables = {
          - "ansible_host" = "127.0.0.1"
        } -> null
    }

  # ansible_host.baz will be created
  + resource "ansible_host" "baz" {
      + groups    = [
          + "stage",
        ]
      + id        = (known after apply)
      + name      = "baz"
      + variables = {
          + "ansible_host" = "localhost"
        }
    }

  # spacelift_aws_integration_attachment.aws must be replaced
-/+ resource "spacelift_aws_integration_attachment" "aws" {
      ~ attachment_id  = "01HSH9AG9JTHSKPMB30MF4M4GX" -> (known after apply)
      ~ id             = "01HQV4XANFANXQY4NS3HDNJSCN/ansible-applications-testing-stage" -> (known after apply)
      ~ stack_id       = "ansible-applications-testing-stage" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # spacelift_environment_variable.terraform_state_key must be replaced
-/+ resource "spacelift_environment_variable" "terraform_state_key" {
      ~ checksum   = "98e5749891b90c15514126d27e1ca0149213a76bca10e5a677362249260e3e4e" -> (known after apply)
      ~ id         = "stack/ansible-applications-testing-stage/TERRAFORM_STATE_KEY" -> (known after apply)
        name       = "TERRAFORM_STATE_KEY"
      ~ stack_id   = "ansible-applications-testing-stage" # forces replacement -> (known after apply) # forces replacement
      ~ value      = (sensitive value) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # spacelift_stack.ansible will be created
  + resource "spacelift_stack" "ansible" {
      + administrative                   = false
      + autodeploy                       = false
      + autoretry                        = false
      + aws_assume_role_policy_statement = (known after apply)
      + branch                           = "stage-testing"
      + enable_local_preview             = false
      + github_action_deploy             = true
      + id                               = (known after apply)
      + labels                           = [
          + "ansible",
          + "depends-on:applications-testing-stage",
        ]
      + manage_state                     = true
      + name                             = "Ansible (applications/baz/stage)"
      + protect_from_deletion            = false
      + repository                       = "spacelift-ansible"
      + runner_image                     = "public.ecr.aws/y7n4m3q8/spacelift-runner-ansible:latest"
      + slug                             = (known after apply)
      + space_id                         = "omicron7-01HS1TBZCJ35FSNJ9AC9QTY7WF"
      + terraform_external_state_access  = false
      + terraform_smart_sanitization     = false
      + terraform_workflow_tool          = (known after apply)

      + ansible {
          + playbook = "playbook.yml"
        }
    }

  # spacelift_stack.this will be updated in-place
  ~ resource "spacelift_stack" "this" {
        id                               = "applications-testing-stage"
      ~ name                             = "applications/testing/stage" -> "applications/baz/stage"
      ~ project_root                     = "applications/testing/stage" -> "applications/baz/stage"
        # (29 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 6 to destroy.

[01HSXN7G334Z1QK0BK6FT8CK4N] Changes are GO
[01HSXN7G334Z1QK0BK6FT8CK4N] Uploading the list of managed resources...
[01HSXN7G334Z1QK0BK6FT8CK4N] Please be aware that the run changes calculation includes output changes.
[01HSXN7G334Z1QK0BK6FT8CK4N] Resource list upload is GO
[01HSXN7G334Z1QK0BK6FT8CK4N] Generating JSON representation of the plan...
[01HSXN7G334Z1QK0BK6FT8CK4N] JSON representation is GO
[01HSXN7G334Z1QK0BK6FT8CK4N] Loading custom plan policy inputs...
[01HSXN7G334Z1QK0BK6FT8CK4N] 0 custom plan policy inputs found
[01HSXN7G334Z1QK0BK6FT8CK4N] No plan policies to evaluate
```

</details>